{
    "class_name": "Sequential",
    "backend": "tensorflow",
    "config": {
        "name": "model 1",
        "layers": [
            {
                "class_name": "Conv2D",
                "config": {
                    "bias_regularizer": null,
                    "bias_initializer": {"class_name": "Zeros", "config": {}},
                    "activity_regularizer": null,
                    "name": "conv2d_1",
                    "kernel_size": [5, 5],
                    "kernel_constraint": null,
                    "batch_input_shape": [null, 7, 8, 8],
                    "dtype": "float32",
                    "trainable": true,
                    "data_format": "channels_first",
                    "padding": "same",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "strides": [1, 1],
                    "use_bias": true,
                    "bias_constraint": null,
                    "activation": "relu",
                    "kernel_regularizer": null,
                    "dilation_rate": [1, 1],
                    "filters": 32
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "bias_regularizer": null,
                    "bias_initializer": {"class_name": "Zeros", "config": {}},
                    "activity_regularizer": null,
                    "name": "conv2d_2",
                    "kernel_size": [5, 5],
                    "kernel_constraint": null,
                    "trainable": true,
                    "data_format": "channels_first",
                    "padding": "same",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "strides": [1, 1],
                    "use_bias": true,
                    "bias_constraint": null,
                    "activation": "relu",
                    "kernel_regularizer": null,
                    "dilation_rate": [1, 1],
                    "filters": 64
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "bias_regularizer": null,
                    "bias_initializer": {"class_name": "Zeros", "config": {}},
                    "activity_regularizer": null,
                    "name": "conv2d_3",
                    "kernel_size": [5, 5],
                    "kernel_constraint": null,
                    "trainable": true,
                    "data_format": "channels_first",
                    "padding": "same",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "strides": [1, 1],
                    "use_bias": true,
                    "bias_constraint": null,
                    "activation": "relu",
                    "kernel_regularizer": null,
                    "dilation_rate": [1, 1],
                    "filters": 64
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "bias_regularizer": null,
                    "bias_initializer": {"class_name": "Zeros", "config": {}},
                    "activity_regularizer": null,
                    "name": "conv2d_4",
                    "kernel_size": [5, 5],
                    "kernel_constraint": null,
                    "trainable": true,
                    "data_format": "channels_first",
                    "padding": "same",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "strides": [1, 1],
                    "use_bias": true,
                    "bias_constraint": null,
                    "activation": "relu",
                    "kernel_regularizer": null,
                    "dilation_rate": [1, 1],
                    "filters": 64
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "bias_initializer": {"class_name": "Zeros", "config": {}},
                    "activity_regularizer": null,
                    "name": "dense_1",
                    "kernel_constraint": null,
                    "trainable": true,
                    "activation": "relu",
                    "units": 32,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "use_bias": true,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "bias_regularizer": null
                }
            },
            {
                "class_name": "Flatten",
                "config": {
                    "trainable": true,
                    "name": "flatten_1",
                    "data_format": "channels_last"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "bias_initializer": {"class_name": "Zeros", "config": {}},
                    "activity_regularizer": null,
                    "name": "dense_2",
                    "kernel_constraint": null,
                    "trainable": true,
                    "activation": "tanh",
                    "units": 1,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "use_bias": true,
                    "bias_constraint": null,
                    "kernel_regularizer": null,
                    "bias_regularizer": null
                }
            }
        ]
    },
    "keras_version": "2.2.4"
}
